In [1]:
import pandas as pd

In [2]:
data = [[1, 2, 3], [4, 5], [7, 8, 9]]
data

[[1, 2, 3], [4, 5], [7, 8, 9]]

In [3]:
list('321')

['3', '2', '1']

In [4]:
df = pd.DataFrame(data, list('321'), list('zyx'))
df

   z  y    x
3  1  2  3.0
2  4  5  NaN
1  7  8  9.0

In [5]:
df.sort_index(inplace = True)

In [6]:
df

   z  y    x
1  7  8  9.0
2  4  5  NaN
3  1  2  3.0

In [8]:
df.sort_index(inplace = True, axis = 1)

In [16]:
df

     x  y  z
1  9.0  8  7
2  NaN  5  4
3  3.0  2  1

In [20]:
df.sort_values(by = ['x', 'y'], inplace = True)
df

   z  y    x
3  1  2  3.0
1  7  8  9.0
2  4  5  NaN

In [24]:
df.sort_values(by = '3', axis = 1, inplace = True)
df

   z  y    x
3  1  2  3.0
1  7  8  9.0
2  4  5  NaN